src/test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10   # warm-up
    - duration: 60
      arrivalRate: 50  # load test
    - duration: 60
      arrivalRate: 100 # stress test

scenarios:
  - flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/menu"